Revit 2027 API
BuiltInFailures.GroupFailures.CannotLinkAnnotationsForSomeViews Property
 Annotations for some views cannot be displayed from linked file.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotLinkAnnotationsForSomeViews { get; }
Public Shared ReadOnly Property CannotLinkAnnotationsForSomeViews As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotLinkAnnotationsForSomeViews {
	FailureDefinitionId^ get ();
}
static member CannotLinkAnnotationsForSomeViews : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GroupFailures Class
Autodesk.Revit.DB Namespace